{
  "pl": {
    "title": "O mnie",
    "about": [
      {
        "subtitle": "Kim jestem?",
        "description": "Urodziłem się w 1998 roku. Jestem absolwentem studiów I stopnia Politechniki Świętokrzyskiej w Kielcach na kierunku Informatyka, gdzie uzyskałem stopień inżyniera informatyka ze specjalizacją - Systemy informacyjne. Obecnie pracuję w pracy niezwiązanej z branżą IT. Jednak aby to zmienić stale rozwijam się studiując informatykę (II stopień), gdzie zgłębiam wiedzę z zakresu ogólnopojętej informatyki, a w czasie wolnym rozszerzając swoją wiedzę w zakresie technologii webowych."
      },
      {
        "subtitle": "Jak wygląda moja droga?",
        "description": "Swoje kształcenie w tym kierunku rozpocząłem już w technikum informatycznym, które zakończyło się uzyskaniem dyplomu technika informatyka. Na tamtym etapie programowanie było moją piętą achillesową. Postanowiłem to zmienić i rozpocząć naukę programowania. Podczas nauki programowania szczególnie zafascynowałem się web developerką. Do dziś staram się podnosić swoje kwalifikacje w tym zakresie, udowadniając sobie, że ciągła praca nad sobą pozwoli mi osiągnąć wyznaczony cel pomimo wielu przeciwności jakie napotkałem lub napotkam po drodze."
      },
      {
        "subtitle": "Jak pracuje?",
        "description": "Stawiam sobie wysokie poprzeczki, patrzę na swoją pracę krytycznym okiem, aby stale mieć motywację do podnoszenia swoich kompetencji interpersonalnych oraz zawodowych. Pomimo codziennych obowiązków staram się, aby moja praca była na jak najwyższym poziomie."
      },
      {
        "subtitle": "Obecny status",
        "description": "Obecnie studiuję niestacjonarnie Informatykę II stopnia na Politechnice Świętokrzyskiej w Kielcach. Aby móc opłacić studia pracuję w branży odległej od branży IT. W wolnych chwilach uczę się nowych rzeczy z zakresu programowania webowego. Staram się aby moja nauka była jak najbardziej powiązana ze studiami poprzez realizację projektów wykonanych w technologiach webowych."
      }
    ]
  },
  "eng": {
    "title": "O mnie",
    "about": [
      {
        "subtitle": "Who am I?",
        "description": "I was born in 1998. I am a graduate of the first degree studies at the University of Technology in Kielce. I have obtained computer scienceengineer degree with specialization - Information Systems. I 'mcurrently working in industry not related with IT. However in order tochange this, I am still learning and expanding my knowledge bystudying Computer Science at University of Technology in Kielce (II degree), and in free time, expanding my web technologies knowledge."
      },
      {
        "subtitle": "What is my path?",
        "description": "I started my education at technical school. There I obtained IT technician diploma. In that moment programming was my weakpoint. I decided to change that and started to learn programming.When I was learning about programming, I was fascinated by webdevelopment. Till Today I am trying to improve my qualifications inweb development proving to myself that continuous work on myself will allow me to achieve the goals, despite the adversities that Iencountered or encounter on my way."
      },
      {
        "subtitle": "How I work?",
        "description": "I set challenges for myself, I'm watching my work with critical eye,thanks to this I still have motivation to enhance my professional andinterpersonal competences. Despite every day duties I am trying domy work on maximum level."
      },
      {
        "subtitle": "Current status",
        "description": "Currently I am studying computer science of the II degree extramural at the University of Technology in Kielce. To be able to pay for my studies, I work in an industry not related with IT. In my free time I am learning new features and frameworks of web programming.  I try to make my learning as closely related to my studies as it possible by realization projects in web technologies."
      }
    ]
  }
}